__all__ = ['en_punct_pattern', 
           'cn_punct_pattern', 
           'all_punct_pattern', 
           'math_symbols_pattern', 
           'en_pattern', 
           'cn_pattern',
           'num_pattern',
           'illegal_patterns',
           'cn_illegal_patterns',
           'en_illegal_patterns',
           'all_puncts'
           ]

## 英文合法标点符号
en_punct_pattern = r'[\,\.\?\:\!]' 

## 中文合法标点符号
cn_punct_pattern = r'[，。；：、！\？]'

## 中英文合法标点符号
all_punct_pattern = r'[\,\.\?\:\!，。；：、！？]'

all_puncts = r'[\!\"\#\$\%\&\'\(\)\*\+\,\-\.\/\:\;\<\=\>\?\@\[\]\\\^\_\`\{\|\}\~～！，。？《》/：；”“’‘【】「」！¥……（）——]'

## 数学公式模式
math_match_pattern = r'(\$\$.*?\$\$|\$.*?\$)'

## 数学公式字符
math_symbols_pattern = r'[\"\!\'\*\+\-\/\:\<\=\>\(\)\[\]\{\\\}\¯\±\×\÷\|《̸ͰͱͲͳʹ͵Ͷͷͺͻͼͽ;Ϳ΄΅Ά·ΈΉΊΌΎΏΐΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩΪΫάέήίΰαβγδεζηθικλμνξοπρςστυφχψωϊϋόύώϏϐϑϒϓϔϕϖϗϘϙϚϛϜϝϞϟϠϡϢϣϤϥϦϧϨϩϪϫϬϭϮϯϰϱϲϳϴϵ϶ϷϸϹϺϻϼϽϾϿ•′″‴→↔⇀∀∁∂∃∄∅∆∇∈∉∊∋∌∍∎∏∐∑−∓∔∕∖∗∘∙√∛∜∝∞∟∠∡∢∣∤∥∦∧∨∩∪∫∬∭∮∯∰∱∲∳∴∵∶∷∸∹∺∻∼∽∾∿≀≁≂≃≄≅≆≇≈≉≊≋≌≍≎≏≐≑≒≓≔≕≖≗≘≙≚≛≜≝≞≟≠≡≢≣≤≥≦≧≨≩≪≫≬≭≮≯≰≱≲≳≴≵≶≷≸≹≺≻≼≽≾≿⊀⊁⊂⊃⊄⊅⊆⊇⊈⊉⊊⊋⊌⊍⊎⊏⊐⊑⊒⊓⊔⊕⊖⊗⊘⊙⊚⊛⊜⊝⊞⊟⊠⊡⊢⊣⊤⊥⊦⊧⊨⊩⊪⊫⊬⊭⊮⊯⊰⊱⊲⊳⊴⊵⊶⊷⊸⊹⊺⊻⊼⊽⊾⊿⋀⋁⋂⋃⋄⋅⋆⋇⋈⋉⋊⋋⋌⋍⋎⋏⋐⋑⋒⋓⋔⋕⋖⋗⋘⋙⋚⋛⋜⋝⋞⋟⋠⋡⋢⋣⋤⋥⋦⋧⋨⋩⋪⋫⋬⋭⋮⋯⋰⋱⋲⋳⋴⋵⋶⋷⋸⋹⋺⋻⋼⋽⋾⋿⌈⌉⌊⌋⌢⧵⫋⫌＋－＜＝＞△◯°□■]'

## 英文字符
en_pattern = r'[a-zA-z\'\-\.]'

## 阿拉伯数字
num_pattern = r'[0-9]'

## 中文字符
cn_pattern = r'[\u4e00-\u9fff]'

## 非法字符集
illegal_patterns = r'[^ \!\"\#\$\%\&\'\(\)\*\+\,\-\.\/\:\;\<\=\>\?\@\[\]\\\^\_\`\{\|\}\~～！，。？《》/：；”“’‘【】「」！¥……（）——a-zA-z\'\-0-9\u4e00-\u9fff\¯\±\×\÷\|《̸ͰͱͲͳʹ͵Ͷͷͺͻͼͽ;Ϳ΄΅Ά·ΈΉΊΌΎΏΐΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩΪΫάέήίΰαβγδεζηθικλμνξοπρςστυφχψωϊϋόύώϏϐϑϒϓϔϕϖϗϘϙϚϛϜϝϞϟϠϡϢϣϤϥϦϧϨϩϪϫϬϭϮϯϰϱϲϳϴϵ϶ϷϸϹϺϻϼϽϾϿ•′″‴→↔⇀∀∁∂∃∄∅∆∇∈∉∊∋∌∍∎∏∐∑−∓∔∕∖∗∘∙√∛∜∝∞∟∠∡∢∣∤∥∦∧∨∩∪∫∬∭∮∯∰∱∲∳∴∵∶∷∸∹∺∻∼∽∾∿≀≁≂≃≄≅≆≇≈≉≊≋≌≍≎≏≐≑≒≓≔≕≖≗≘≙≚≛≜≝≞≟≠≡≢≣≤≥≦≧≨≩≪≫≬≭≮≯≰≱≲≳≴≵≶≷≸≹≺≻≼≽≾≿⊀⊁⊂⊃⊄⊅⊆⊇⊈⊉⊊⊋⊌⊍⊎⊏⊐⊑⊒⊓⊔⊕⊖⊗⊘⊙⊚⊛⊜⊝⊞⊟⊠⊡⊢⊣⊤⊥⊦⊧⊨⊩⊪⊫⊬⊭⊮⊯⊰⊱⊲⊳⊴⊵⊶⊷⊸⊹⊺⊻⊼⊽⊾⊿⋀⋁⋂⋃⋄⋅⋆⋇⋈⋉⋊⋋⋌⋍⋎⋏⋐⋑⋒⋓⋔⋕⋖⋗⋘⋙⋚⋛⋜⋝⋞⋟⋠⋡⋢⋣⋤⋥⋦⋧⋨⋩⋪⋫⋬⋭⋮⋯⋰⋱⋲⋳⋴⋵⋶⋷⋸⋹⋺⋻⋼⋽⋾⋿⌈⌉⌊⌋⌢⧵⫋⫌＋－＜＝＞△◯°□■①②③※℃]'

## 非法中文字符集
cn_illegal_patterns = r'[^ \u4e00-\u9fff，。；：、！？]'

## 非法英文字符集
#en_illegal_patterns = r'[^ a-zA-z\.\,\?\:\!\;\'\-]'
en_illegal_patterns = r'[^ a-zA-z\.\,\?\:\!\;]'
################备注################
'''
汉字编码范围
    r'\u3007'                  # 〇
    r'\u3400-\u4dbf'           # CJK扩展A:[3400-4DBF]
    r'\u4e00-\u9fff'           # CJK基本:[4E00-9FFF]
    r'\uf900-\ufaff'           # CJK兼容:[F900-FAFF]
    r'\U00020000-\U0002A6DF'   # CJK扩展B:[20000-2A6DF]
    r'\U0002A703-\U0002B73F'   # CJK扩展C:[2A700-2B73F]
    r'\U0002B740-\U0002B81D'   # CJK扩展D:[2B740-2B81D]
    r'\U0002F80A-\U0002FA1F'   # CJK兼容扩展:[2F800-2FA1F]
'''


'''
elements = {
    "H": {"中文名": "氢", "拼音": "qīng"},
    "He": {"中文名": "氦", "拼音": "hài"},
    "Li": {"中文名": "锂", "拼音": "lǐ"},
    "Be": {"中文名": "铍", "拼音": "pí"},
    "B": {"中文名": "硼", "拼音": "péng"},
    "C": {"中文名": "碳", "拼音": "tàn"},
    "N": {"中文名": "氮", "拼音": "dàn"},
    "O": {"中文名": "氧", "拼音": "yǎng"},
    "F": {"中文名": "氟", "拼音": "fú"},
    "Ne": {"中文名": "氖", "拼音": "nǎi"},
    "Na": {"中文名": "钠", "拼音": "nà"},
    "Mg": {"中文名": "镁", "拼音": "měi"},
    "Al": {"中文名": "铝", "拼音": "lǚ"},
    "Si": {"中文名": "硅", "拼音": "guī"},
    "P": {"中文名": "磷", "拼音": "lín"},
    "S": {"中文名": "硫", "拼音": "liú"},
    "Cl": {"中文名": "氯", "拼音": "lǜ"},
    "Ar": {"中文名": "氩", "拼音": "yà"},
    "K": {"中文名": "钾", "拼音": "jiǎ"},
    "Ca": {"中文名": "钙", "拼音": "gài"},
    "Sc": {"中文名": "钪", "拼音": "kàng"},
    "Ti": {"中文名": "钛", "拼音": "tài"},
    "V": {"中文名": "钒", "拼音": "fán"},
    "Cr": {"中文名": "铬", "拼音": "gè"},
    "Mn": {"中文名": "锰", "拼音": "měng"},
    "Fe": {"中文名": "铁", "拼音": "tiě"},
    "Co": {"中文名": "钴", "拼音": "gǔ"},
    "Ni": {"中文名": "镍", "拼音": "niè"},
    "Cu": {"中文名": "铜", "拼音": "tóng"},
    "Zn": {"中文名": "锌", "拼音": "xīn"},
    "Ga": {"中文名": "镓", "拼音": "jiā"},
    "Ge": {"中文名": "锗", "拼音": "zhě"},
    "As": {"中文名": "砷", "拼音": "shēn"},
    "Se": {"中文名": "硒", "拼音": "xī"},
    "Br": {"中文名": "溴", "拼音": "xiù"},
    "Kr": {"中文名": "氪", "拼音": "kè"},
    "Rb": {"中文名": "铷", "拼音": "rú"},
    "Sr": {"中文名": "锶", "拼音": "sī"},
    "Y": {"中文名": "钇", "拼音": "yǐ"},
    "Zr": {"中文名": "锆", "拼音": "gào"},
    "Nb": {"中文名": "铌", "拼音": "ní"},
    "Mo": {"中文名": "钼", "拼音": "mù"},
    "Tc": {"中文名": "锝", "拼音": "dé"},
    "Ru": {"中文名": "钌", "拼音": "liǎo"},
    "Rh": {"中文名": "铑", "拼音": "lǎo"},
    "Pd": {"中文名": "钯", "拼音": "bǎ"},
    "Ag": {"中文名": "银", "拼音": "yín"},
    "Cd": {"中文名": "镉", "拼音": "gé"},
    "In": {"中文名": "铟", "拼音": "yīn"},
    "Sn": {"中文名": "锡", "拼音": "xī"},
    "Sb": {"中文名": "锑", "拼音": "tī"},
    "Te": {"中文名": "碲", "拼音": "dì"},
    "I": {"中文名": "碘", "拼音": "diǎn"},
    "Xe": {"中文名": "氙", "拼音": "xiān"},
    "Cs": {"中文名": "铯", "拼音": "sè"},
    "Ba": {"中文名": "钡", "拼音": "bèi"},
    "La": {"中文名": "镧", "拼音": "lán"},
    "Ce": {"中文名": "铈", "拼音": "shì"},
    "Pr": {"中文名": "镨", "拼音": "pǔ"},
    "Nd": {"中文名": "钕", "拼音": "nǚ"},
    "Pm": {"中文名": "钷", "拼音": "pǒ"},
    "Sm": {"中文名": "钐", "拼音": "shān"},
    "Eu": {"中文名": "铕", "拼音": "yǒu"},
    "Gd": {"中文名": "钆", "拼音": "gá"},
    "Tb": {"中文名": "铽", "拼音": "tè"},
    "Dy": {"中文名": "镝", "拼音": "dī"},
    "Ho": {"中文名": "钬", "拼音": "huǒ"},
    "Er": {"中文名": "铒", "拼音": "ěr"},
    "Tm": {"中文名": "铥", "拼音": "diū"},
    "Yb": {"中文名": "镱", "拼音": "yì"},
    "Lu": {"中文名": "镥", "拼音": "lǔ"},
    "Hf": {"中文名": "铪", "拼音": "hā"},
    "Ta": {"中文名": "钽", "拼音": "tǎn"},
    "W": {"中文名": "钨", "拼音": "wū"},
    "Re": {"中文名": "铼", "拼音": "lái"},
    "Os": {"中文名": "锇", "拼音": "é"},
    "Ir": {"中文名": "铱", "拼音": "yī"},
    "Pt": {"中文名": "铂", "拼音": "bó"},
    "Au": {"中文名": "金", "拼音": "jīn"},
    "Hg": {"中文名": "汞", "拼音": "gǒng"},
    "Tl": {"中文名": "铊", "拼音": "tā"},
    "Pb": {"中文名": "铅", "拼音": "qiān"},
    "Bi": {"中文名": "铋", "拼音": "bì"},
    "Po": {"中文名": "钋", "拼音": "pō"},
    "At": {"中文名": "砹", "拼音": "ài"},
    "Rn": {"中文名": "氡", "拼音": "dōng"},
    "Fr": {"中文名": "钫", "拼音": "fāng"},
    "Ra": {"中文名": "镭", "拼音": "léi"},
    "Ac": {"中文名": "锕", "拼音": "ā"},
    "Th": {"中文名": "钍", "拼音": "tǔ"},
    "Pa": {"中文名": "镤", "拼音": "pú"},
    "U": {"中文名": "铀", "拼音": "yóu"},
    "Np": {"中文名": "镎", "拼音": "ná"},
    "Pu": {"中文名": "钚", "拼音": "bù"},
    "Am": {"中文名": "镅", "拼音": "méi"},
    "Cm": {"中文名": "锔", "拼音": "jú"},
    "Bk": {"中文名": "锫", "拼音": "péi"},
    "Cf": {"中文名": "锎", "拼音": "kāi"},
    "Es": {"中文名": "锿", "拼音": "āi"},
    "Fm": {"中文名": "镄", "拼音": "fèi"},
    "Md": {"中文名": "钔", "拼音": "mén"},
    "No": {"中文名": "锘", "拼音": "nuò"},
    "Lr": {"中文名": "铹", "拼音": "láo"},
    "Mc": {"中文名": "镆", "拼音": "mò"},
}
'''